Revit 2024 API
SchemaCommon.Thumbnail Property
 The property labeled "Thumbnail" common to all visual Asset types.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string Thumbnail { get; }
Visual Basic
Public Shared ReadOnly Property Thumbnail As String
	Get
Visual C++
public:
static property String^ Thumbnail {
	String^ get ();
}
Remarks
 This property is a "AssetPropertyList" of type "AssetPropertyString".
See Also
SchemaCommon Class
Autodesk.Revit.DB.Visual Namespace